### 데이터 입력해 데이터 프레임 만들기

**1. `pandas` 패키지 로드하기**

In [1]:
import pandas as pd

**2. 데이터 프레임 만들기**

In [2]:
df = pd.DataFrame({ : ,
                    : ,                   
                    : })
df

  name  english  math
0  유재석       90    50
1  서연진       80    60
2  박해미       60   100
3  주유민       70    40

#### 3. 특정 변수의 값 추출하기

0    90
1    80
2    60
3    70
Name: english, dtype: int64

#### 4. 변수의 값으로 합계 구하기

300

#### 5. 변수의 값으로 평균 구하기

In [5]:
  # 영어 점수 평균

75.0

### 판다스 엑셀 파일 불러오기

#### 1. 엑셀 파일 불러오기

In [6]:
df_exam =  # 엑셀 파일을 불러와 df_exam에 할당
df_exam                                     # 출력

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

#### 2. 분석하기

In [7]:
  #영어 평균

84.9

In [8]:
  #과학 평균

59.45

In [9]:
# 변수의 값 개수 구하기
x = [1, 2, 3, 4, 5]
x

[1, 2, 3, 4, 5]

5

In [11]:
# 데이터 프레임의 행 개수 구하기
df = pd.DataFrame({'a' : [1, 2, 3],
                   'b' : [4, 5, 6]})
df

   a  b
0  1  4
1  2  5
2  3  6

3

In [13]:
                          # df_exam의 행 개수

20

In [14]:
  # english 합계를 행 개수로 나누기

84.9

In [15]:
  # science 합계를 행 개수로 나누기

59.45

### 1. CSV 파일 불러오기

In [18]:
df_csv_exam = pd.read_csv('exam.csv')
df_csv_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

---